---
kind: method
id: M:Autodesk.Revit.DB.ExternalDefinition.Dispose
source: html/1b8cf1f1-2b87-2aa4-1811-58f4b49372a6.htm
---
# Autodesk.Revit.DB.ExternalDefinition.Dispose Method

Releases all resources used by the ExternalDefinition

## Syntax (C#)
```csharp
public void Dispose()
```